package algorithms;

/**
 * @author Andrew Lichman vmdeep@yandex.ru
 *
 * @task
 * Напишите код, который для заданного диапазона целых положительных чисел min..max возвращает только те числа, в которых не повторяется ни одна цифра.
 * Например, для диапазона 98..103 он возвращает числа (98, 102, 103) и не возвращает (99, 100, 101). 
 * Рассматриваются решения, оптимальные как по объему кода (наиболее краткие), так и по скорости выполнения.
 * Оптимизированное по скорости решение должно за разумное время выдать ВСЕ возможные числа с неповторяющимися цифрами (от 0 до 9876543210).
 * Для кратких решений разрешена реализация на языках, отличных от Java.
 */
public class NumberPrinter {

	/**
	 * @param args
	 */
	public static void main(String[] args) {

        
	}

}
